#coding:utf-8
import urlparse


# 公共正则
A_TAG_REGEX = r"<a[^<>]*?href=['\"](?P<url>[^'\"\+]*?)['\"][^>\+]*?>(<[^<>]*?>)?([?P<text>^<>]*?)(<[^<>]*?>)?</a>"             # 获取a标签
A_TAG_HREF_REGEX = r'<a[^<>]*?href="([^"]+?)"[^>]*?>.*?</a>'      # 获取a标签的href内容
A_TAG_NUM_REGEX = r"<a[^<>]*?href=['\"](?P<page_url>[^'\"]*?)['\"][^>\+]*?>(<[^<>]*?>)?(?P<page_id>\d)(<[^<>]*?>)?</a>"   # 带数字的a标签
two_xie_gang = r'[^\/]*?[\/]?[^\/]*?[\/]?[^\/]*?' # 非连住的斜杠最多可以有两个
regex_date = r"((\d{0,4}[\.:-年]?\d{2}[\.:-月]?\d{2}日?) ?(\d{0,2}[\.:-]?\d{0,2}[\.:-]?\d{0,2}))"
regex_date0 = r"\[?((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日)|(\d{4}.\d{2}.\d{2})|(\d{4}-\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{4}-\d{2}-\d{2}\d{2}:\d{2}))"
regex_date0_beifen = r">((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日)|(\d{4}.\d{2}.\d{2})|(\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2})|(\d{4}-\d{2}-\d{2} \d{2}:\d{2}))<"

# text是数字a标签
A_TAG_NUM_REGEX_DYNAMIC = r"<a[^<>]*?href=['\"](?P<page_url>[^'\"]*?)['\"][^>\+]*?>(<[^<>]*?>)?(?P<page_id>%s)<" # 动态提取text是数字的a标签，动态替换%s处的内容
A_TAG_NUM_REGEX_DYNAMIC_beifen = r"<a[^<>]*?href=['\"](?P<page_url>[^'\"]*?)['\"][^>\+]*?>(<[^<>]*?>)?(?P<page_id>%s)(<[^<>]*?>)?</a>"
A_TAG_NUM_REGEX_DYNAMIC_beifen0 = r"<a[^<>]*?href=['\"](?P<page_url>[^'\"]*?)['\"][^>]*?>(?P<page_id>%s)</a>" # 动态替换%s处的内容


# 翻页用正则
NEXTPAGE_TAG_REGEX = r"<a[^<>]*?href=['\"](?P<next_url>[^'\"\+]*?)['\"][^>\+]*?>(<[^<>]*?>)?(\[?(下一页|下页))"
NEXTPAGE_TAG_REGEX_beifen = r"<a[^<>]*?href=['\"](?P<next_url>[^'\"\+]*?)['\"][^>\+]*?>(<[^<>]*?>)?(下一页|下页|\[下一页\]|\[下页\])(<[^<>]*?>)?</a>"   # 找下一页标签


# 单个页面提取正则
PAGE_TITLE_REGEX0 = r"<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><=]*?)</a>(<[^<>]*?>)+"+regex_date0
PAGE_TITLE_REGEX0_beifen = r"<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><=]*?)</a>[^\/]*?[\/]?[^\/]*?[\/]?[^\/]*?"+regex_date0
PAGE_TITLE_REGEX0_beifen = r"<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><=]*?)</a>[^\/]*?[\/]?[^\/]*?[\/]?[^\/]*?((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日))"

PAGE_TITLE_REGEX0_beifen0 = r"<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><=]*?)</a>[^\/]*?[\/]?[^\/]*?((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日))"

PAGE_TITLE_REGEX1 = regex_date0+r"[^\/]*?[\/]?[^\/]*?[\/]?[^\/]*?<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><]*?)</a>"
PAGE_TITLE_REGEX1_beifen = r"((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日))[^\/]*?[\/]?[^\/]*?<a[^<>]*?href=['\"]([^'\"]*?)['\"][^>]*?>([^/><]*?)</a>"

PAGE_TITLE_REGEX3 = r"href=['\"](.*?)['\"].*?>(.*?)</a>.*?((\d{4}-\d{2}-\d{2})|(\d{1,2}-\d{2})|(\d{4}年\d{2}月\d{2}日))"
ZGTJ_SINGLE_PAGE_REGEX = r'href="(/.*)".*class="title".*>(.*)</a>.*(\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2})'
ZGTJ_NEXT_PAGE_REGEX = r'href=\'(.*)\'>下一页</a>'



#lxml xpath
xpath_text_next_page = '//a[text()="下一页"/@href]'            # 取下一页的a标签的url
